docs: add mermaid diagram
